Revit 2024 API
UnitTypeId.MeganewtonMetersPerMeter Property
 Meganewton meters per meter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId MeganewtonMetersPerMeter { get; }
Visual Basic
Public Shared ReadOnly Property MeganewtonMetersPerMeter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MeganewtonMetersPerMeter {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace